In [1]:
import pandas as pd
import numpy as np

In [3]:
s= pd.Series([1,3,5,6],index=['r1','r2','r3','r4'])
s

r1    1
r2    3
r3    5
r4    6
dtype: int64

In [4]:
s.r2

3

In [7]:
s[3]

6

In [8]:
s.values

array([1, 3, 5, 6])

In [9]:
s.index

Index(['r1', 'r2', 'r3', 'r4'], dtype='object')

In [11]:
s.value_counts()

6    1
5    1
3    1
1    1
dtype: int64

In [13]:
df= pd.DataFrame([[1,8],[3,4],[5,9],[7,2],[2,6]],index=['a1','a2','a3','a4','a5'],columns=['c1','c2'])
df

    c1  c2
a1   1   8
a2   3   4
a3   5   9
a4   7   2
a5   2   6

In [14]:
df[1:3]

    c1  c2
a2   3   4
a3   5   9

In [15]:
df[0:2]

    c1  c2
a1   1   8
a2   3   4

In [16]:
df[0:]

    c1  c2
a1   1   8
a2   3   4
a3   5   9
a4   7   2
a5   2   6

In [17]:
df['c1']

a1    1
a2    3
a3    5
a4    7
a5    2
Name: c1, dtype: int64

In [18]:
df.iloc[3,1]

2

In [19]:
df

    c1  c2
a1   1   8
a2   3   4
a3   5   9
a4   7   2
a5   2   6

In [20]:
df.values

array([[1, 8],
       [3, 4],
       [5, 9],
       [7, 2],
       [2, 6]])

In [21]:
df.index

Index(['a1', 'a2', 'a3', 'a4', 'a5'], dtype='object')

In [22]:
df[df<5]

     c1   c2
a1  1.0  NaN
a2  3.0  4.0
a3  NaN  NaN
a4  NaN  2.0
a5  2.0  NaN

In [27]:
df.head(1)

    c1  c2
a1   1   8

In [28]:
df.tail(1)

    c1  c2
a5   2   6

In [29]:
df.columns

Index(['c1', 'c2'], dtype='object')

In [31]:
df.T

    a1  a2  a3  a4  a5
c1   1   3   5   7   2
c2   8   4   9   2   6

In [32]:
df

    c1  c2
a1   1   8
a2   3   4
a3   5   9
a4   7   2
a5   2   6

In [33]:
df.drop('a4',axis=0)

    c1  c2
a1   1   8
a2   3   4
a3   5   9
a5   2   6

In [34]:
df.drop('a3')

    c1  c2
a1   1   8
a2   3   4
a4   7   2
a5   2   6

In [36]:
df.describe()

             c1        c2
count  5.000000  5.000000
mean   3.600000  5.800000
std    2.408319  2.863564
min    1.000000  2.000000
25%    2.000000  4.000000
50%    3.000000  6.000000
75%    5.000000  8.000000
max    7.000000  9.000000

In [37]:
#other examples

In [38]:
df=pd.DataFrame({'x1':[1,2], 'x2':[3,4], 'x3':[5,6]})
df

   x1  x2  x3
0   1   3   5
1   2   4   6

In [44]:
bf=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=['a1','a2','a3'], columns=['c1','c2','c3'])
bf

    c1  c2  c3
a1   1   2   3
a2   4   5   6
a3   7   8   9

In [45]:
df= pd.DataFrame({'x1':[1,2,3],'x2':[4,5,6],'x3':[7,8,9]})
df

   x1  x2  x3
0   1   4   7
1   2   5   8
2   3   6   9

In [47]:
data={'Name':["ali","sara","mamad","hasan"],
    'location':["meshad","yazd","aliabad","ozgol"],
    'age':[5,30,15,46]
}

In [49]:
af=pd.DataFrame(data)
af

    Name location  age
0    ali   meshad    5
1   sara     yazd   30
2  mamad  aliabad   15
3  hasan    ozgol   46

In [53]:
af.sort_index(axis=1)

    Name  age location
0    ali    5   meshad
1   sara   30     yazd
2  mamad   15  aliabad
3  hasan   46    ozgol

In [58]:
af.sort_values(by='age', ascending=False)

    Name location  age
3  hasan    ozgol   46
1   sara     yazd   30
2  mamad  aliabad   15
0    ali   meshad    5

In [55]:
af.sort_index(axis=0,ascending=False)

    Name location  age
3  hasan    ozgol   46
2  mamad  aliabad   15
1   sara     yazd   30
0    ali   meshad    5

In [56]:
af.sort_index(axis=0)

    Name location  age
0    ali   meshad    5
1   sara     yazd   30
2  mamad  aliabad   15
3  hasan    ozgol   46

In [61]:
af

    Name location  age
0    ali   meshad    5
1   sara     yazd   30
2  mamad  aliabad   15
3  hasan    ozgol   46

In [62]:
af[af.age<30]

    Name location  age
0    ali   meshad    5
2  mamad  aliabad   15

In [66]:
af.iloc[1][1]

'yazd'

In [67]:
af.iloc[1]['age']

30

In [68]:
pd.DataFrame(np.random.randn(10,4))

          0         1         2         3
0  1.123635  1.422176  0.624735  1.806807
1 -0.349656  0.433268  0.223164 -0.886347
2  1.496595  0.294611  0.178647  1.048053
3 -0.326055  1.592162  0.972543  1.283699
4 -0.424429 -0.370335 -1.352860  1.271792
5 -0.532887 -0.437560  1.083716 -0.569800
6 -0.534187 -0.564584 -0.084289 -0.449047
7 -1.438008 -2.170802 -2.616737 -0.194373
8 -1.407095  0.328723 -1.212933 -0.123334
9 -0.061268 -0.140029 -0.663879  0.914132